#include <iostream>
using namespace std;

//数组三种定义方式
//1.数据类型  数组名[数组长度];
//2.数据类型  数组名[数组长度] = {值1，值2.....}
//3.数据类型  数组名[] = {值1，值2.....}

/*int main() {

	//1.数据类型  数组名[数组长度];
	int arr[5];
	//1.1 给数组中的元素赋值
	arr[0] = 0;
	arr[1] = 10;
	arr[2] = 20;
	arr[3] = 30;
	arr[4] = 40;
	//注意：数组元素下标从0开始
	//cout << arr[2] << endl;

	//2.数据类型  数组名[数组长度] = { 值1，值2..... }
	//int arr2[5] = { 10,20,30,40,50 };
	//for (int i = 0;i < 5;i++)
	//{
	//	cout << arr2[i] << endl;
	//}

	//3.数据类型  数组名[] = {值1，值2.....}

	int arr3[] = { 90,80,70,60,50 };
	for (int a = 0;a < 5;a++)
	{
		cout << arr3[a] << endl;
	}
	system("pause");
	return 0;
 }*/