#include<iostream>
using namespace std;

//对象的初始化和清理
//构造函数，进行初始化操作

/*class Person
{
	//1.构造函数没有返回值，也不用写void
	//2.函数名与类名相同
	//3.构造函数可以有参数，可以发生重载
	//4.创建对象的时候，构造函数会自动调用，而且只调用一次
public:
	Person()
	{
		cout << "构造函数的调用" << endl;
	}


	//析构函数，进行清理操作
	//1.函数名与类名相同，前边加~
	//2.析构函数没有返回值，也不用写void
	//3.析构函数不可以有参数，不可以发生重载
	//4.对象在销毁前 会自动调用析构函数，而且只会调用一次

	~Person()
	{
		cout << "析构函数的调用" << endl;
	}
};


//构造和析构都是必须有的实现，如果我们自己不提供，编译器会自动提供一个空实现的构造和析构
void test01()
{
	Person P;//在栈上的数据，test01执行后会释放
}

int main() {

	test01();
	

	system("pause");
		return 0;
}*/